from wxpy import *
from time import *

bot = Bot()
friends = []

pre_friends = ['艾然', '毕德希', '曹晓岚', '曹振新', '程蓬捷',
               '陈谷乔', '陈峻标', '陈凯', '陈史弘', '陈宇轩', '陈梓杰',
               '崔可', '戴恒毅', '方健梁', '高霞', '官泽桐', '郭中涛', '韩霁雯',
               '韩琪澳', '黄恒', '黄心怡', '黄云鑫', '佳佳', '江昊', '简文雅',
               '金宇捷', '季雯协', '康伟泰', '梁嘉浩', '廖懿斌', '李福建', '李俊辉',
               '李坤宇', '林冬敏', '凌泰炀', '李涛', '刘红瑜', '刘宇飞', '李奕宁',
               '陆华', '陆宗羲..', '彭先楠', '彭语菲', '蒲实', '钱缪峰',
               '容志毅', '邵梓洋', '舒心亦', '宋理想', '宋秋辰', '孙炳懿', '苏梓恒',
               '汪朝蔚', '王凯莉', '王天欣', '王晔', '王玥靓', '韦文韬', '徐俐',
               '萧文贤', '谢宛芸', '杨霆钧', '姚志伟', '叶鸣风-省实-电子', '于景轩',
               '张娟老师', '张铭麟', '张世炜', '张天宇', '张文翰', '张旖旎', '张宇',
               '张雨辰', '郑倚天', '周宇', '周月', '邹海桥', '邹之挺'
               ]
n = len(pre_friends)
print(n)

for i in range(0,n):
    my_friend = bot.friends().search(pre_friends[i])
    add_friend = ensure_one(my_friend)
    friends.append(add_friend)
    print(add_friend)
print(friends)


if len(friends) == n:
    print('应该没有错')
else:
    print('出现错误，可能有人没找到，别运行！')


text1 = ['老部长','老毕','晓岚大帅哥', '曹老师', '蓬捷', '学弟',
         '标叔', '凯哥', '弘哥', '学长', 'orange杰', '崔可', '戴戴',
         '方队', '学姐', '学长', '涛涛', '韩霁雯', '色色', '学弟', '黄心怡',
         '云鑫', '佳佳哥哥', '昊哥', '文雅', '宇捷', '季大学霸', 'Tiger', '浩爷',
         '斌斌', '肥ken', '俊辉', '坤宇', '林冬敏', '太阳', '李老师', '小红', '宇飞',
         '奕宁', '陆老师', '陆学霸', '姐夫', '语菲', '蒲实', '钱总', '学弟',
         '哨子', '舒心亦', '理想', '夜壶', '孙炳懿', '学长', '朝蔚', 'carry姐',
         '学姐', '晔晔', '月亮姐姐', '韬哥', '徐老师', '萧大帅哥', '谢宛芸', '杨大帅哥',
         '大师', '学妹', '景轩', '张老师', '部长', '炜哥', '天宇', '张文翰', '旖旎',
         '宇哥', '雨辰', '天天', '周大帅哥', '周周', '乔哥', '挺哥'
         ]
text2 = ['新年快乐！新的一年天天开心！']
text3 = []  

#查看对应人和文字的有没有错
'''
if len(text1) == n:
    for i in range(0,n):
        print(pre_friends[i]+'\t'+text1[i]+'\n')
'''


for i in range(0, len(text1)):
    text3.append(text1[i]+text2[0])
    friends[i].send(text3[i])
    sleep(1)
